[
     {
        "modalID" : "md01",
        "title" : "Natural Language Processing Self-Learning", 
        "date" : "June 2018 - Ongoing",
        "preview" : "Following Udemy coursework, I am using Python to learn the basics and some advanced concepts in Natural Language Processing. This will include multiple mini projects on which more information is coming soon. Please check back here and on my blog!",
        "description" : "Following Udemy coursework, I am using Python to learn the basics and some advanced concepts in Natural Language Processing. This will include multiple mini projects on which more information is coming soon. Please check back here and on my blog",
        "notable" : true
    },
    {
        "modalID" : "md02",
        "title" : "Game Dev Master Study 1: The Legend of Zelda", 
        "date" : "April 2018 - ongoing",
        "preview" : "My first master study in game design, apart of a series of projects where I analyze and try to recreate parts of old classics to learn game development and design.",
        "description" : "After deciding that I would like to pursue a career in independent game development, I decided to take the advice of many devs and start doing master study project. This is my first one, where I picked Nintendo's The Legend of Zelda on NES from which to try and recreate specific elements. I do not own ANY of the assets used in this project. Everything belongs to Nintendo, and I am using them only for educational purposes. The download and use of the demo file should only be to test out the work I've made. It is an extremely small chunk of the game for very basic game dev education. In this I've learned to handle data persistence for inventory and location between multiple scene transitions, data serialization and saving, better handling for attack animations, enemy AI state machines with abstract classes, and learning Unity's new tilemap options. There will be more to come with this project as well as more master studies in which I will know better to not use the origial art!",
        "image1" : "img/zelda1.jpg",
        "image2" : "img/zelda2.jpg",
        "link1_text": "Windows Demo Download",
        "link1": "https://drive.google.com/open?id=1GEa8HMsdeENbt9mOkbXnbd3evto13tcq",
        "link2_text": "Mac Demo Download",
        "link2": "https://drive.google.com/open?id=1mAHbTR_xEAKcHrUX4zf5yGw__9m-Tf-S",
        "tags" : "Unity Engine 2017 | Csharp | data persistence | abstract classes | state machines",
        "notable" : true
    },
    {
        "modalID" : "md04",
        "title" : "TokuGeek Portfolio Website", 
        "date" : "January 2018 - Ongoing",
        "preview" : "You're already here, silly! This is the website you are on! Still in development, but getting stronger everyday. My first experience using Javascript to make a dynamic webpage.",
        "description" : "My portfolio site is my first experience using Javascript for web development, my first time managing and configuring a server, and my first experience making a single-page web application. I'm using everything I know about web development to best create this website with AngularJS. I had very little experience before in web development outside of my visually simplistic database projects, so I decided to code my own portfolio using tools I hadn't touched before. Still to come: Listing blogs from my wordpress blog on the home page and blog page, more responsive layouts, mobile layout design, information and project filtering, both ongoing and notable projects on the home page, a recent youtube video of work I've done on the homepage, and plenty more I haven't thought of yet. Thank you for visiting!",
        "image1": "img/tokup1.png",
        "image2": "img/tokup2.png",
        "image3": "img/tokup3.png",
        "image4": "img/tokup4.png",
        "link1_text":"Github Repo",
        "link1":"https://github.com/aumcgl/austin-mcg.com",
        "tags" : "AngularJS | Javascript | HTML | CSS | Flexboxes | Nginx server management",
        "notable" : true
    },
    {
        "modalID" : "md05",
        "title" : "Japanese-English Translation 1: Persona 5 New Game Plus Guide", 
        "date" : "Fall 2017",
        "preview" : "First Japanese-English translation project for a crucial section of the Persona 5 strategy guide.",
        "description" : "I do not own Persona 5 or the majority of the information in the translated document. This was a personal project to test my ability to translate Japanese into English while providing my own insight into the guide. The guide document is a single section from the Persona 5 Official Complete Guide (ISBN: 978-4-04-892416-0). While this is for education purposes, if you intend to use this guide, I recommend you purchase a copy of the guide before using this. There is no official translation of this section in any English guide, so hopefully the information in it can be useful.",
        "image1" : "img/persona1.png",
        "link1_text":"Persona 5 New Game Plus Max Guide Translation",
        "link1": "https://drive.google.com/open?id=1zSE75rY3AvxmBBjNSP76mF-qioTei4kd",
        "tags":"Japanese Translation | Game Writing",
        "notable" : true
    },
    {
        "modalID" : "md06",
        "title" : "Team Initiated Study in Game Dev - Loch Gair Manor Prototype", 
        "date" : "Spring 2017",
        "preview" : "Team Initiated Study course in game development where myself and two teammates attempted to design, prototype, test, and redesign a game in Unity Enging in under 15 weeks. Some disasters are fun and good to learn from. Demo included.",
        "description" : "A team initiated study course is a course that didn't previously exist on a campus and a small team of students developed the course and asked for an instructor to help lead. Bianca Godden, Quinten Lambert, and myself attempted to design and develop a horror exploration game entitled Loch Gair Manor. The player was trapped in a mansion that has been abandoned and has a light-fearing demon lurking the halls, and the player has to make it to the astronomy tower by crafting items and solving puzzles to best escape the demon in each area. We had extensive design work finished for this game, and even the demo above doesn't contain every completed piece. We finished a working prototype and held a campus-wide play testing event to receive feedback. Altogether we gained experience in developing a top-down camera movement game, interacting with objects, sound events, a crude inventory system, an even cruder endless hallway test, a simple library puzzle, and basic light physics on a 2D tilemap.",
        "image1": "img/LG1.png",
        "image2": "img/LG2.png",
        "image3": "img/LG3.png",
        "image4": "img/LG4.png",
        "link1_text":"Demo Video",
        "link1":"https://www.youtube.com/watch?v=URjKRzyM7wo",
        "link2_text":"Endless Hallway Video",
        "link2":"https://www.youtube.com/watch?v=8YxiU_IPWKQ",
        "link3_text":"Windows Download",
        "link3":"https://drive.google.com/open?id=0BwmimG8lxYWZN29xMjVHT3JsNnM",
        "link4_text":"Mac Download",
        "link4":"https://drive.google.com/open?id=0BwmimG8lxYWZNUQ1UE9nTXAxdXc",
        "tags":"Unity Engine 4 | Csharp | Playtesting | Group Game Dev",
        "notable" : false
    },
    {
        "modalID" : "md07",
        "title" : "Humidity and Temperature Sensor for Pine Mountain Settlement School", 
        "date" : "Fall 2016",
        "preview" : "Large scale group project for Embedded Systems course. Job simulation classroom environment. Full class goal to make arduino based temperature and humidity sensors for Pine Mountain Settlement School in Eastern Kentucky. Still in use.",
        "description" : "My Embedded Systems course came together to make working temperature and humidity sensor devices for Pine Mountain Settlements schools to protect artefacts and heat and moisture sensitive materials. The group was a large workplace simulated environment consisting of multiple subteams working on smaller aspects such as the web interface, power management, and sensor functionality. I worked on the group for architecture, ensuring the state machine that the system ran on was well designed, implemented, documented, and well communicated throughout the rest class team. This course included several visits to Pine Mountain and opportunities to speak with the director of the school both on and off site to ensure project quality. The end of the course saw a decent, working prototype with plenty of data files and readings to analyze. It was passed on to another group to make the final product.",
        "image1" : "img/EmbSys.png",
        "link1_text": "Github Repo",
        "link1": "https://github.com/aumcgl/PMSS-Sensor",
        "tags" : "Aruino | C | Circuit Design | State Machines | Community Outreach | large team dev",
        "notable" : false
    },
    {
        "modalID" : "md08",
        "title" : "Ikigai - Side Scrolling Game Test in Unity Engine", 
        "date" : "Fall 2016",
        "preview" : "Senior capstone project. My first attempt at using a game engine to develop a simple side scrolling game with extensive design work. Demo and documentation included.",
        "description" : "For my senior capstone in computer science, I decided to aim for a dream and learn how to make a basic game in Unity Engine, the first game engine I've touched. Ikigai was initially a combination project between my Computer Science and Asian Studies disciplines, using research on Japanese mental health in diverse communities. The game was meant to follow a young, nonbinary-gendered character who got trapped in a realm of Japanese mythological creatures known as Youkai after fleeing from home on Tanbata. I worked closely with a writer, Julia Boyd, to prepare for this project. In this project, I was able to learn to make a character move and do basic collisions, jump and fall with gravity physics and animations, health and stamina UI, the ability to sprint with stamina, and a basic enemy that chased after the player with a state machine for AI. NOTE: The artwork for the game belongs to Unity and the background artwork belongs to Hands Like Houses and Rise Records. Every piece of art used was purely for educational purposes.",
        "image1": "img/ikigai1.png",
        "image2": "img/ikigai2.png",
        "image3": "img/ikigai3.png",
        "image4": "img/ikigai4.png",
        "link1_text": "Windows Download",
        "link1": "https://drive.google.com/open?id=0BwmimG8lxYWZRnoxZzV1MTc1MXc",
        "link2_text": "Mac Download",
        "link2": "https://drive.google.com/open?id=0BwmimG8lxYWZN0luV1VIcmdySEk",
        "link3_text": "Game Design Document",
        "link3": "https://drive.google.com/open?id=1L9Yf7jgfNOHFI9fsJTWHkdAwvxZdTeT4",
        "tags":"Unity Engine 4 | CSharp | State Machines | AI",
        "notable" : false
    },
    {
        "modalID" : "md09",
        "title" : "CodeWorkout Q&A Database", 
        "date" : "Spring 2016",
        "preview" : "Database project for Virginia Tech's Computer Science Department, expanding on their own CodeWorkout website. Question and Answer forum skeleton.",
        "description" : "This project was for a Software Engineering course. This is another team made database project for real-world use for Virginia Tech's Computer Science Department. CodeWorkout is a VT made website for programming education, and my team was asked to add on as much of a Q&A forum as we could. The website dealt with a long list of exercises and students to complete those exercises, and our goal was to incorporate a Q&A system that allowed students to ask questions about specific exercises and get feedback from peers and instructors. This was the majority of the team's first encounter with open source programming with GitHub. We aimed to work with a basic agile development cycle.",
        "image1": "img/CW1.png",
        "image2": "img/CW2.png",
        "image3": "img/CW3.png",
        "image4": "img/CW4.png",
        "image5": "img/CW5.png",
        "link1_text": "Software Design Doc",
        "link1": "https://docs.google.com/document/d/18FzWtmBLO0eOK6wPNPjqJ0lex2-QJPb3imEPscEfaYo/edit?usp=sharing",
        "link2_text": "Github Repo",
        "link2": "https://github.com/aumcgl/code-workout",
        "tags":"Open-Source | Git | Ruby | Ruby on Rails | HTML | CSS | ER Diagram | Community Outreach ",
        "notable" : false
    },
    {
        "modalID" : "md10",
        "title" : "Faculty Development Event Attendance Database - Berea College", 
        "date" : "Fall 2015",
        "preview" : "Service-Learning, team project for database systems course. Prototype database made for Berea College's Faculty Development department. Polished version still in use.",
        "description" : "I worked on this project as part of Berea College's Database Systems course. This was a team handled project where each group worked with a member of the community who needed a database made for the work they were doing. We created this database as a prototype for Berea College's Faculty Development department in order to keep track of events that could be used for faculty development as well as which faculty members were in attendance and in what frequencies by multiple factors. We worked on a rudimentary agile development cycle meeting with our clients, Leslie Ortquist-Ahrens and Channing Francis, designing each step, and implementing what we could. Everyone in the team had their own particular jobs, for instance, I worked on back-end database management as well as the group writer, but everyone shared a bit of every duty. This prototype has been remade by other groups and is currently in use. Note: The person speaking in the linked video is teammate Quinten Lambert, not myself.",
        "image1": "img/fddb1.png",
        "image2": "img/fddb2.png",
        "image3": "img/fddb3.png",
        "image4": "img/fddb4.png",
        "link1_text": "Narrated Video Tour",
        "link1": "https://drive.google.com/open?id=1RgMBuI3qvr5Z3LRLbzhcvOn67oIUfLW2",
        "link2_text": "Usage Manual",
        "link2": "https://drive.google.com/open?id=1Ir1Xk4wujcon0YJNt9DERFBfPXa4AlvR",
        "link3_text": "ER Diagram and Report",
        "link3": "https://drive.google.com/open?id=1nSqzDDKDnFgOof3ZMJ-OOxGdA5YYeXgQ",
        "tags" : "PHP | HTML | CSS | SQL | Bootstrap | PHPmyAdmin | ER Diagrams | Community Outreach",
        "notable" : false
    }
]
